layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "sigmoid1"
  top: "ip2"
  param{
    lr_mult:1
  }
  inner_product_param{
    num_output: 100
  }
}

layer {
  name: "sigmoid2"
  bottom: "ip2"
  top: "sigmoid2"
  type: "Sigmoid"
}




